Repository: Yeyint282/Health-Tracker-APP
Catalog: lib/l10n/app_*.arb
Languages: my

# appTitle
source: Health Tracker
my: ကျန်းမာရေး ခြေရာခံ

# welcome
source: Welcome to Health Tracker App
my: ကျန်းမာရေး ခြေရာခံ အက်ပ်မှ ကြိုဆိုပါတယ်။

source: Get Started
my: စတင်ရန်

# homeTitle
source: Health Dashboard
my: ကျန်းမာရေး ဒက်ရှ်ဘုတ်

# settingsTitle
source: Settings
my: ဆက်တင်များ

# profileTitle
source: User Profile
my: အသုံးပြုသူ ပရိုဖိုင်

source: Create Profile
my: ပရိုဖိုင် ဖန်တီးရန်

source: updateProfile
my: ပရိုဖိုင် အပ်ဒိတ်လုပ်ရန်

source: Select User
my: အသုံးပြုသူ ရွေးချယ်ရန်

source: Blood Pressure
my: သွေးပေါင်ချိန်

source: Blood Sugar
my: သွေးတွင်းသကြားဓာတ်

source: Daily Activity
my: နေ့စဉ်လှုပ်ရှားမှု

source: Medications
my: ဆေးဝါးများ

source: Settings
my: ဆက်တင်များ

source: Today
my: ယနေ့

source: Yesterday
my: မနေ့က

source: This Week
my: ဒီအပတ်

source: This Month
my: ဒီလ

source: Add Reading
my: ဖတ်မှတ်မှု ထည့်ရန်

source: Update Reading
my: ဖတ်မှတ်မှု အပ်ဒိတ်လုပ်ရန်

source: View History
my: မှတ်တမ်းကြည့်ရန်

source: Date
my: ရက်စွဲ

source: Time
my: အချိန်

source: Notes
my: မှတ်စုများ

source: Save
my: သိမ်းဆည်းရန်

source: Cancel
my: ဖျက်သိမ်းရန်

source: Delete
my: ဖျက်ရန်

source: Edit
my: တည်းဖြတ်ရန်

source: Confirm
my: အတည်ပြုရန်

source: Language
my: ဘာသာစကား

source: English
my: အင်္ဂလိပ်

source: Myanmar
my: မြန်မာ

source: Dark Mode
my: အမှောင်မုဒ်

source: Notifications
my: သတိပေးချက်များ

# version
source: Version 1.0.0
my: ဗားရှင်း 1.0.0

source: Normal
my: ပုံမှန်

source: Elevated
my: အနည်းငယ်မြင့်

source: High
my: မြင့်မား

# crisis
source: Hypertensive Crisis
my: သွေးတိုး အရေးပေါ်အခြေအနေ

source: Low
my: နိမ့်

source: Last Reading
my: နောက်ဆုံး ဖတ်မှတ်မှု

source: Select Date
my: ရက်စွဲ ရွေးပါ

source: Select Time
my: အချိန် ရွေးပါ

# noReadings
source: No readings yet. Add your first one!
my: ဖတ်မှတ်မှု မရှိသေးပါ။ ပထမဆုံးအကြိမ် ထည့်သွင်းပါ။

source: Optional
my: ရွေးချယ်နိုင်သည်

source: Required
my: လိုအပ်သည်

source: Name
my: အမည်

source: Age
my: အသက်

source: Gender
my: ကျား/မ

source: Weight
my: ကိုယ်အလေးချိန်

source: Height
my: အရပ်

source: Male
my: အမျိုးသား

source: Female
my: အမျိုးသမီး

source: Other
my: အခြား

source: kg
my: ကီလိုဂရမ်

source: cm
my: စင်တီမီတာ

source: Activity
my: လှုပ်ရှားမှု

source: Steps
my: ခြေလှမ်းများ

source: Calories
my: ကယ်လိုရီ

source: Distance
my: အကွာအဝေး

source: Duration
my: ကြာချိန်

# activeMins
source: Active Minutes
my: လှုပ်ရှားသော မိနစ်များ

source: Steps Count
my: ခြေလှမ်းအရေအတွက်

source: Calories Burned
my: လောင်ကျွမ်းသော ကယ်လိုရီများ

source: Random
my: ကျပန်း

source: Distance Walked
my: လမ်းလျှောက်ခဲ့သော အကွာအဝေး

source: Exercise Type
my: လေ့ကျင့်ခန်း အမျိုးအစား

source: Walking
my: လမ်းလျှောက်ခြင်း

source: Running
my: ပြေးခြင်း

source: Cycling
my: စက်ဘီးစီးခြင်း

source: Swimming
my: ရေကူးခြင်း

source: Workout
my: ကိုယ်လက်လေ့ကျင့်ခန်း

source: Medication Name
my: ဆေးအမည်

source: Dosage
my: သောက်သုံးရန် ပမာဏ

source: Frequency
my: အကြိမ်ရေ

source: Daily Reminder
my: နေ့စဉ်သတိပေးချက်

source: Once Daily
my: တစ်နေ့တစ်ကြိမ်

source: Twice Daily
my: တစ်နေ့နှစ်ကြိမ်

source: Three Times Daily
my: တစ်နေ့သုံးကြိမ်

source: As Needed
my: လိုအပ်သလို

source: Morning
my: မနက်ခင်း

source: Afternoon
my: နေ့လယ်

source: Evening
my: ညနေ

source: Night
my: ည

source: Before Meals
my: အစာမစားမီ

source: After Meals
my: အစာစားပြီးနောက်

source: With Meals
my: အစာနှင့်အတူ

source: User Profile Setup
my: အသုံးပြုသူ ပရိုဖိုင် စနစ်ထည့်သွင်းခြင်း

# stepOneOfThree
source: Step 1 of 3
my: အဆင့် ၁/၃

# stepTwoOfThree
source: Step 2 of 3
my: အဆင့် ၂/၃

# stepThreeOfThree
source: Step 3 of 3
my: အဆင့် ၃/၃

source: Basic Information
my: အခြေခံအချက်အလက်များ

source: Health Information
my: ကျန်းမာရေး အချက်အလက်များ

source: Preferences
my: နှစ်သက်ရာများ

source: Next
my: နောက်သို့

source: Previous
my: ယခင်

source: Finish
my: ပြီးဆုံး

# pleaseEnterName
source: Please enter your name
my: ကျေးဇူးပြု၍ သင့်အမည်ကို ထည့်သွင်းပါ။

# pleaseEnterAge
source: Please enter your age
my: ကျေးဇူးပြု၍ သင့်အသက်ကို ထည့်သွင်းပါ။

# pleaseEnterWeight
source: Please enter your weight
my: ကျေးဇူးပြု၍ သင့်ကိုယ်အလေးချိန်ကို ထည့်သွင်းပါ။

# pleaseEnterHeight
source: Please enter your height
my: ကျေးဇူးပြု၍ သင့်အရပ်ကို ထည့်သွင်းပါ။

# pleaseSelectGender
source: Please select your gender
my: ကျေးဇူးပြု၍ ကျား/မ ကို ရွေးချယ်ပါ။

# enterWeight
source: Enter your weight
my: သင့်ကိုယ်အလေးချိန်ကို ထည့်သွင်းပါ

# enterHeight
source: Enter your height
my: သင့်အရပ်ကို ထည့်သွင်းပါ

# pleaseCorrectErrorsInStepOne
source: Please correct errors in Basic Information.
my: ကျေးဇူးပြု၍ အခြေခံအချက်အလက်များတွင် မှားယွင်းမှုများကို ပြင်ဆင်ပါ။

# pleaseCorrectErrorsInStepTwo
source: Please correct errors in Health Information.
my: ကျေးဇူးပြု၍ ကျန်းမာရေး အချက်အလက်များတွင် မှားယွင်းမှုများကို ပြင်ဆင်ပါ။

source: Profile created successfully!
my: ပရိုဖိုင် ဖန်တီးမှု အောင်မြင်ပါသည်။

source: Multiple users supported
my: အသုံးပြုသူ အများအပြားကို ပံ့ပိုးသည်

source: Switch User
my: အသုံးပြုသူ ပြောင်းရန်

source: Add New User
my: အသုံးပြုသူ အသစ်ထည့်ရန်

source: Delete User
my: အသုံးပြုသူ ဖျက်ရန်

# confirmDeleteUser
source: Are you sure you want to delete this user?
my: ဤအသုံးပြုသူကို ဖျက်ရန် သေချာပါသလား။

# userDeleted
source: User deleted successfully
my: အသုံးပြုသူ ဖျက်ပြီးပါပြီ။

# noUsers
source: No users found
my: အသုံးပြုသူ မတွေ့ပါ။

# createFirstUser
source: Create your first user profile
my: ပထမဆုံး အသုံးပြုသူ ပရိုဖိုင်ကို ဖန်တီးပါ။

source: Health Metrics
my: ကျန်းမာရေး တိုင်းတာမှုများ

source: Recent Readings
my: မကြာသေးမီ ဖတ်မှတ်မှုများ

source: Quick Actions
my: အမြန် လုပ်ဆောင်ချက်များ

source: View Charts
my: ဇယားများ ကြည့်ရန်

source: Set Reminder
my: သတိပေးချက် သတ်မှတ်ရန်

source: Export Data
my: ဒေတာ ထုတ်ယူရန်

source: Import Data
my: ဒေတာ ထည့်သွင်းရန်

source: Backup Data
my: ဒေတာ အရန်ကူးရန်

source: About App
my: အက်ပ်အကြောင်း

source: Privacy Policy
my: ကိုယ်ရေးကိုယ်တာမူဝါဒ

source: Terms of Service
my: ဝန်ဆောင်မှုစည်းမျဉ်းများ

source: Contact Support
my: အကူအညီရယူရန် ဆက်သွယ်ပါ

source: Rate App
my: အက်ပ်ကို အဆင့်သတ်မှတ်ရန်

source: Share App
my: အက်ပ်ကို မျှဝေရန်

source: Offline Mode
my: အော့ဖ်လိုင်းမုဒ်

# dataStoredLocally
source: All data is stored locally on your device
my: ဒေတာအားလုံးကို သင့်စက်တွင် ဒေသတွင်း သိမ်းဆည်းထားသည်

# noInternetRequired
source: No internet connection required
my: အင်တာနက်ချိတ်ဆက်မှု မလိုအပ်ပါ

# yourDataIsSecure
source: Your health data is completely private and secure
my: သင်၏ ကျန်းမာရေးဒေတာသည် လုံးဝလျှို့ဝှက်ပြီး လုံခြုံသည်

source: Press Back Again To Exit
my: ထွက်ရန် နောက်တစ်ကြိမ် နောက်သို့ ပြန်နှိပ်ပါ။

source: Upload Photo
my: ဓာတ်ပုံတင်ရန်

source: Remove Photo
my: ဓာတ်ပုံဖယ်ရှားရန်

source: Camera
my: ကင်မရာ

source: Photo Library
my: ဓာတ်ပုံပြခန်း

source: Guest
my: ဧည့်သည်

source: Manage Profiles
my: ပရိုဖိုင်များ စီမံခန့်ခွဲရန်

# noUsersFound
source: No User Found
my: အသုံးပြုသူ မတွေ့ပါ

source: No Users To Select
my: ရွေးချယ်ရန် အသုံးပြုသူ မရှိပါ

source: Selected
my: ရွေးချယ်ပြီး

source: Prediabetes
my: ဆီးချိုရောဂါဖြစ်နိုင်ခြေရှိသူ

source: Diabetes
my: ဆီးချိုရောဂါ
